# Tips and Trick Python Pandas 19

# Formatting Tampilan Pandas Data Frame

# Import Module

In [29]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.2.4
1.20.1

# Buat Data Frame

In [30]:
n_rows = 5
n_cols = 2
cols = ['omset','operasional']

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)),
                 columns = cols)
df

   omset  operasional
0      3            7
1     15            8
2      6            3
3      4           11
4      2           19

In [31]:
df['omset'] = df['omset']*100_000
df['operasional'] = df['operasional'] * 10_000
df

     omset  operasional
0   300000        70000
1  1500000        80000
2   600000        30000
3   400000       110000
4   200000       190000

In [32]:
df.index = pd.util.testing.makeDateIndex(n_rows, freq='D')
df = df.reset_index()
df = df.rename(columns={'index':'tanggal'})
df

     tanggal    omset  operasional
0 2000-01-01   300000        70000
1 2000-01-02  1500000        80000
2 2000-01-03   600000        30000
3 2000-01-04   400000       110000
4 2000-01-05   200000       190000

# Melakukan Formatting Tampilan Data Frame

In [33]:
formatku = {'tanggal':'{:%d/%m/%y}',
           'operasional':'Rp {:.2f}',
           'omset':'Rp {:.2f}'}
laporan = df.style.format(formatku)
laporan

Bukan Data Frame namun `Styler`

In [34]:
type(laporan)

pandas.io.formats.style.Styler

In [35]:
laporan.hide_index()

In [36]:
laporan.set_caption('Data Omset dan Operasional')

In [38]:
laporan.highlight_min('omset', color='pink')
laporan.highlight_max('omset', color='lightgreen')

laporan.highlight_min('operasional', color='lightblue')
laporan.highlight_max('operasional', color='grey')